featureswag/STM32_Project/8-2_DMA+AD多通道/Hardware/ad.c
#include "stm32f10x.h"                  // Device header


uint16_t AD_Value[4];
/* *
    * @brief: initialize ADC
    * @param: none
    * @retval: none
*/
void AD_Init(void)
{
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1,ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1,ENABLE);
    RCC_ADCCLKConfig(RCC_PCLK2_Div6); // ADCCLK = 72MHz / 6 = 12MHz

    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN; // analog input
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3; 
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOA,&GPIO_InitStructure);

    ADC_RegularChannelConfig(ADC1,ADC_Channel_0, 1, ADC_SampleTime_55Cycles5);
    /*
        ! ADD ADC_Channel_0, ADC_Channel_1, ADC_Channel_2, ADC_Channel_3
    */
    ADC_RegularChannelConfig(ADC1,ADC_Channel_0, 1, ADC_SampleTime_55Cycles5);
    ADC_RegularChannelConfig(ADC1,ADC_Channel_1, 2, ADC_SampleTime_55Cycles5);
    ADC_RegularChannelConfig(ADC1,ADC_Channel_2, 3, ADC_SampleTime_55Cycles5);
    ADC_RegularChannelConfig(ADC1,ADC_Channel_3, 4, ADC_SampleTime_55Cycles5);
   
    ADC_InitTypeDef ADC_InitStructure; 
    ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;     // independent mode, ADC1
    ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right; // right alignment
    ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None; // no external trigger
    ADC_InitStructure.ADC_ContinuousConvMode = ENABLE; // single conversion mode
    ADC_InitStructure.ADC_ScanConvMode = ENABLE; // ! ADD: Scan mode revise to ENABLE
    ADC_InitStructure.ADC_NbrOfChannel = 4; // ! ADD: number of channel revise to 4
    ADC_Init(ADC1,&ADC_InitStructure);

    /**
     * ! ADD DMA CONFIGURATION
    */
    DMA_InitTypeDef DMA_InitStructure;
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&ADC1->DR;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord; 
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable; 
    DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)AD_Value; 
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord; 
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
    DMA_InitStructure.DMA_BufferSize = 4;
    DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
    DMA_InitStructure.DMA_M2M = DMA_M2M_Disable; 
    DMA_InitStructure.DMA_Priority = DMA_Priority_Medium;
    DMA_Init(DMA1_Channel1,&DMA_InitStructure);

    DMA_Cmd(DMA1_Channel1,ENABLE);

    ADC_DMACmd(ADC1,ENABLE);//! ADD DMA enable, ADC1 will send signal to DMA1


    ADC_Cmd(ADC1,ENABLE);
    ADC_ResetCalibration(ADC1);
    while(ADC_GetResetCalibrationStatus(ADC1) == SET);/* wait until the end of the reset 
                                                         calibration.*/
    ADC_StartCalibration(ADC1);
    while(ADC_GetCalibrationStatus(ADC1) == SET);/* wait until the end of the calibration*/

    ADC_SoftwareStartConvCmd(ADC1,ENABLE);//if turn on ADC continuous conversion mode, enable this command
}

/*if turn on ADC continuous conversion mode, and turn on DMA circular mode, diable AD_GetValue() function
    ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;
    ADC_InitStructure.ADC_ScanConvMode = ENABLE;
    DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;*/
/* *
    * @brief: Get ADC value
    * @param: ADC_Channel
    * @retval: ADC value
*/
/* 
void AD_GetValue(void)
{
    DMA_Cmd(DMA1_Channel1,DISABLE);
    DMA_SetCurrDataCounter(DMA1_Channel1,4);
    DMA_Cmd(DMA1_Channel1,ENABLE);
    ADC_SoftwareStartConvCmd(ADC1,ENABLE);
    while (!DMA_GetFlagStatus(DMA1_FLAG_TC1)); // wait until the end of the conversion
    DMA_ClearFlag(DMA1_FLAG_TC1);
}
*/
